{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from socialgene.neo4j.neo4j import GraphDriver # grab the the neo4j connection\n",
    "from socialgene.config import env_vars\n",
    "import pandas as pd\n",
    "from socialgene.base.socialgene import SocialGene\n",
    "\n",
    "env_vars[\"NEO4J_URI\"] = \"bolt://localhost:7688\"\n",
    "pd.set_option('display.max_rows', 100)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "> Note: While timings here are fast, they also include latency between my computer in Chicago and the server in Madison, WI."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<pre style=\"white-space:pre;overflow-x:auto;line-height:normal;font-family:Menlo,'DejaVu Sans Mono',consolas,'Courier New',monospace\"><span style=\"color: #7fbfbf; text-decoration-color: #7fbfbf\">2024-06-13 17:07:06 </span><span style=\"color: #000080; text-decoration-color: #000080\">INFO    </span> Connected to Neo4j database at bolt:<span style=\"color: #800080; text-decoration-color: #800080\">//</span><span style=\"color: #ff00ff; text-decoration-color: #ff00ff\">localhost</span>:<span style=\"color: #008080; text-decoration-color: #008080; font-weight: bold\">7688</span>                                                          <a href=\"file:///home/chase/Documents/github/kwan_lab/socialgene/sgpy/socialgene/neo4j/neo4j.py\" target=\"_blank\"><span style=\"color: #7f7f7f; text-decoration-color: #7f7f7f\">neo4j.py</span></a><span style=\"color: #7f7f7f; text-decoration-color: #7f7f7f\">:</span><a href=\"file:///home/chase/Documents/github/kwan_lab/socialgene/sgpy/socialgene/neo4j/neo4j.py#61\" target=\"_blank\"><span style=\"color: #7f7f7f; text-decoration-color: #7f7f7f\">61</span></a>\n",
       "</pre>\n"
      ],
      "text/plain": [
       "\u001b[2;36m2024-06-13 17:07:06\u001b[0m\u001b[2;36m \u001b[0m\u001b[34mINFO    \u001b[0m Connected to Neo4j database at bolt:\u001b[35m/\u001b[0m\u001b[35m/\u001b[0m\u001b[95mlocalhost\u001b[0m:\u001b[1;36m7688\u001b[0m                                                          \u001b]8;id=666239;file:///home/chase/Documents/github/kwan_lab/socialgene/sgpy/socialgene/neo4j/neo4j.py\u001b\\\u001b[2mneo4j.py\u001b[0m\u001b]8;;\u001b\\\u001b[2m:\u001b[0m\u001b]8;id=285235;file:///home/chase/Documents/github/kwan_lab/socialgene/sgpy/socialgene/neo4j/neo4j.py#61\u001b\\\u001b[2m61\u001b[0m\u001b]8;;\u001b\\\n"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 11.2 ms, sys: 261 µs, total: 11.5 ms\n",
      "Wall time: 591 ms\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>hmm_acc</th>\n",
       "      <th>description</th>\n",
       "      <th>nucelotide_id</th>\n",
       "      <th>locus_tag</th>\n",
       "      <th>protein_id</th>\n",
       "      <th>e1.description</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>PF00227.29</td>\n",
       "      <td>Proteasome subunit</td>\n",
       "      <td>BGC0000145</td>\n",
       "      <td>None</td>\n",
       "      <td>ABP73653.1</td>\n",
       "      <td>SalI</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>PF00227.29</td>\n",
       "      <td>Proteasome subunit</td>\n",
       "      <td>BGC0000345</td>\n",
       "      <td>None</td>\n",
       "      <td>AHB38505.1</td>\n",
       "      <td>proteasome beta-subunit</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>PF00227.29</td>\n",
       "      <td>Proteasome subunit</td>\n",
       "      <td>BGC0000971</td>\n",
       "      <td>None</td>\n",
       "      <td>CBW54670.1</td>\n",
       "      <td>20S proteasome beta-subunit</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>PF00227.29</td>\n",
       "      <td>Proteasome subunit</td>\n",
       "      <td>BGC0001041</td>\n",
       "      <td>Strop_1015</td>\n",
       "      <td>ABP53490.1</td>\n",
       "      <td>20S proteasome, A and B subunits</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>PF00227.29</td>\n",
       "      <td>Proteasome subunit</td>\n",
       "      <td>BGC0001202</td>\n",
       "      <td>None</td>\n",
       "      <td>AKA59433.1</td>\n",
       "      <td>proteasome subunit beta</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>PF00227.29</td>\n",
       "      <td>Proteasome subunit</td>\n",
       "      <td>BGC0001203</td>\n",
       "      <td>None</td>\n",
       "      <td>AKA59451.1</td>\n",
       "      <td>proteasome subunit beta</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>PF00227.29</td>\n",
       "      <td>Proteasome subunit</td>\n",
       "      <td>BGC0001399</td>\n",
       "      <td>ANIA_03493</td>\n",
       "      <td>CBF76042.1</td>\n",
       "      <td>conserved hypothetical protein</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>PF00227.29</td>\n",
       "      <td>Proteasome subunit</td>\n",
       "      <td>BGC0001829</td>\n",
       "      <td>None</td>\n",
       "      <td>CUX96950.1</td>\n",
       "      <td>TmcC</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "      hmm_acc         description nucelotide_id   locus_tag  protein_id  \\\n",
       "0  PF00227.29  Proteasome subunit    BGC0000145        None  ABP73653.1   \n",
       "1  PF00227.29  Proteasome subunit    BGC0000345        None  AHB38505.1   \n",
       "2  PF00227.29  Proteasome subunit    BGC0000971        None  CBW54670.1   \n",
       "3  PF00227.29  Proteasome subunit    BGC0001041  Strop_1015  ABP53490.1   \n",
       "4  PF00227.29  Proteasome subunit    BGC0001202        None  AKA59433.1   \n",
       "5  PF00227.29  Proteasome subunit    BGC0001203        None  AKA59451.1   \n",
       "6  PF00227.29  Proteasome subunit    BGC0001399  ANIA_03493  CBF76042.1   \n",
       "7  PF00227.29  Proteasome subunit    BGC0001829        None  CUX96950.1   \n",
       "\n",
       "                     e1.description  \n",
       "0                              SalI  \n",
       "1           proteasome beta-subunit  \n",
       "2       20S proteasome beta-subunit  \n",
       "3  20S proteasome, A and B subunits  \n",
       "4           proteasome subunit beta  \n",
       "5           proteasome subunit beta  \n",
       "6    conserved hypothetical protein  \n",
       "7                              TmcC  "
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%time\n",
    "with GraphDriver() as db:\n",
    "        df = db.run(\n",
    "            \"\"\"\n",
    "                MATCH \n",
    "                    (h1:hmm_source {acc:\"PF00227.29\"})-[:SOURCE_DB]-(hmm:hmm),\n",
    "                    (hmm)-[:ANNOTATES]->(:protein)<-[e1:ENCODES]-(n1:nucleotide)\n",
    "                where n1.external_id starts with \"BGC\"\n",
    "                RETURN  \n",
    "                        h1.acc as hmm_acc,\n",
    "                        h1.description as description,\n",
    "                        n1.external_id as nucelotide_id,\n",
    "                        e1.locus_tag as locus_tag,\n",
    "                        e1.external_id as protein_id,\n",
    "                        e1.description\n",
    "        \"\"\",\n",
    "        ).to_df()\n",
    "\n",
    "df\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Count the number of total non MIBiG BGCs"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 2.12 ms, sys: 0 ns, total: 2.12 ms\n",
      "Wall time: 1.54 s\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "1595"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%time\n",
    "with GraphDriver() as db:\n",
    "        df = db.run(\n",
    "            \"\"\"\n",
    "        MATCH (:hmm_source {acc:\"PF00227.29\"})-[:SOURCE_DB]-(:hmm)-[:ANNOTATES]->(:protein)<-[e1:ENCODES]-(n1:nucleotide)-[:ASSEMBLES_TO]-(a1:assembly)\n",
    "        where e1.antismash_region is not null and not n1.external_id starts with \"BGC\" \n",
    "        WITH a1, n1, COUNT(DISTINCT(e1.antismash_region)) as ar_in_nuc\n",
    "        RETURN sum(ar_in_nuc) as count\n",
    "        \n",
    "        \"\"\",\n",
    "        ).value()\n",
    "\n",
    "df[0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 204 µs, sys: 3.39 ms, total: 3.6 ms\n",
      "Wall time: 1.5 s\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>superkingdom_count</th>\n",
       "      <th>phylum_count</th>\n",
       "      <th>class_count</th>\n",
       "      <th>order_count</th>\n",
       "      <th>family_count</th>\n",
       "      <th>genus_count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>3</td>\n",
       "      <td>25</td>\n",
       "      <td>44</td>\n",
       "      <td>93</td>\n",
       "      <td>167</td>\n",
       "      <td>280</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   superkingdom_count  phylum_count  class_count  order_count  family_count  \\\n",
       "0                   3            25           44           93           167   \n",
       "\n",
       "   genus_count  \n",
       "0          280  "
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%time\n",
    "with GraphDriver() as db:\n",
    "        df = db.run(\n",
    "            \"\"\"\n",
    "        MATCH (:hmm_source {acc:\"PF00227.29\"})-[:SOURCE_DB]-(:hmm)-[:ANNOTATES]->(:protein)<-[e1:ENCODES]-(n1:nucleotide)-[:ASSEMBLES_TO]-(a1:assembly)\n",
    "        where e1.antismash_region is not null and not n1.external_id starts with \"BGC\" \n",
    "        RETURN \n",
    "            count(DISTINCT a1.superkingdom) as superkingdom_count,\n",
    "            count(DISTINCT a1.phylum) as phylum_count,\n",
    "            count(DISTINCT a1.class) as class_count,\n",
    "            count(DISTINCT a1.order) as order_count,\n",
    "            count(DISTINCT a1.family) as family_count,\n",
    "            count(DISTINCT a1.genus) as genus_count           \n",
    "        \"\"\",\n",
    "        ).to_df()\n",
    "df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "All BGC types"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 7.28 ms, sys: 93 µs, total: 7.37 ms\n",
      "Wall time: 1.52 s\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>bgc_type</th>\n",
       "      <th>count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[ectoine]</td>\n",
       "      <td>257</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>[NRPS-like]</td>\n",
       "      <td>225</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>[T3PKS]</td>\n",
       "      <td>123</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>[terpene]</td>\n",
       "      <td>107</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>[T1PKS]</td>\n",
       "      <td>81</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>[NRPS, T1PKS]</td>\n",
       "      <td>74</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>[NRPS]</td>\n",
       "      <td>72</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>[arylpolyene, resorcinol]</td>\n",
       "      <td>69</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>[NRPS-like, T1PKS]</td>\n",
       "      <td>65</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>[arylpolyene]</td>\n",
       "      <td>57</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>[NRP-metallophore, NRPS]</td>\n",
       "      <td>38</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>[fungal-RiPP-like]</td>\n",
       "      <td>36</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>[T1PKS, hglE-KS]</td>\n",
       "      <td>34</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>[betalactone]</td>\n",
       "      <td>28</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>[RiPP-like]</td>\n",
       "      <td>27</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>[acyl_amino_acids]</td>\n",
       "      <td>19</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>[acyl_amino_acids, hserlactone]</td>\n",
       "      <td>17</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>[NRPS, NRPS-like, T1PKS]</td>\n",
       "      <td>16</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>[T2PKS]</td>\n",
       "      <td>15</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>[T1PKS, terpene]</td>\n",
       "      <td>15</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>[hglE-KS]</td>\n",
       "      <td>12</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>[redox-cofactor]</td>\n",
       "      <td>11</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>[RRE-containing]</td>\n",
       "      <td>11</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>[lanthipeptide-class-v]</td>\n",
       "      <td>11</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>[RiPP-like, terpene]</td>\n",
       "      <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>[hserlactone]</td>\n",
       "      <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>[LAP]</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>[NAGGN]</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>[thiopeptide]</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>[NRPS-like, T1PKS, transAT-PKS-like]</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>[T1PKS, T2PKS]</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>[NAPAA]</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>[NI-siderophore]</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>[T3PKS, terpene]</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>34</th>\n",
       "      <td>[CDPS]</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35</th>\n",
       "      <td>[cyanobactin]</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>36</th>\n",
       "      <td>[proteusin]</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>37</th>\n",
       "      <td>[NRP-metallophore, NRPS, acyl_amino_acids]</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>38</th>\n",
       "      <td>[T1PKS, betalactone, hglE-KS]</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>39</th>\n",
       "      <td>[phosphonate]</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>40</th>\n",
       "      <td>[phosphonate-like]</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>41</th>\n",
       "      <td>[NRPS-like, betalactone]</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>42</th>\n",
       "      <td>[arylpolyene, resorcinol, terpene]</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>43</th>\n",
       "      <td>[NRPS, hserlactone]</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>44</th>\n",
       "      <td>[other]</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>45</th>\n",
       "      <td>[NRPS, betalactone, transAT-PKS]</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>46</th>\n",
       "      <td>[lassopeptide]</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>47</th>\n",
       "      <td>[NRPS, NRPS-like]</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>48</th>\n",
       "      <td>[thioamitides, thiopeptide]</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>49</th>\n",
       "      <td>[indole]</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>50</th>\n",
       "      <td>[NRPS, NRPS-like, PKS-like, T1PKS, transAT-PKS...</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>51</th>\n",
       "      <td>[PKS-like]</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>52</th>\n",
       "      <td>[NRP-metallophore, NRPS, T1PKS]</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>53</th>\n",
       "      <td>[NRPS, PKS-like, T1PKS, terpene]</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>54</th>\n",
       "      <td>[2dos]</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>55</th>\n",
       "      <td>[NI-siderophore, NRPS]</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>56</th>\n",
       "      <td>[cyclic-lactone-autoinducer]</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>57</th>\n",
       "      <td>[NRPS, T1PKS, terpene]</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>58</th>\n",
       "      <td>[LAP, proteusin, thiopeptide]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>59</th>\n",
       "      <td>[NRPS-like, T1PKS, hglE-KS, transAT-PKS-like]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>60</th>\n",
       "      <td>[thioamitides]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>61</th>\n",
       "      <td>[NRPS, NRPS-like, T1PKS, transAT-PKS-like]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>62</th>\n",
       "      <td>[NRPS-like, RiPP-like, T1PKS, transAT-PKS]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>63</th>\n",
       "      <td>[epipeptide]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>64</th>\n",
       "      <td>[NRPS-like, terpene]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>65</th>\n",
       "      <td>[NRPS, NRPS-like, transAT-PKS]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>66</th>\n",
       "      <td>[NRPS, T1PKS, fungal-RiPP-like]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>67</th>\n",
       "      <td>[T1PKS, fungal-RiPP-like]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>68</th>\n",
       "      <td>[NRP-metallophore, NRPS, NRPS-like, T1PKS]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>69</th>\n",
       "      <td>[arylpolyene, ectoine, resorcinol]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>70</th>\n",
       "      <td>[NRPS, NRPS-like, T1PKS, T3PKS, terpene]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>71</th>\n",
       "      <td>[isocyanide]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>72</th>\n",
       "      <td>[NRPS, NRPS-like, T1PKS, betalactone, transAT-...</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>73</th>\n",
       "      <td>[NRPS-like, transAT-PKS]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>74</th>\n",
       "      <td>[lanthipeptide-class-iv]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>75</th>\n",
       "      <td>[T1PKS, hglE-KS, oligosaccharide]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>76</th>\n",
       "      <td>[NRPS, fungal-RiPP-like, terpene]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>77</th>\n",
       "      <td>[isocyanide-nrp]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>78</th>\n",
       "      <td>[mycosporine-like]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>79</th>\n",
       "      <td>[fungal-RiPP]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>80</th>\n",
       "      <td>[NAPAA, NRPS-like]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>81</th>\n",
       "      <td>[NRPS, T1PKS, T3PKS, terpene]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>82</th>\n",
       "      <td>[LAP, NRPS, T1PKS, thioamitides, thiopeptide]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>83</th>\n",
       "      <td>[LAP, thiopeptide]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>84</th>\n",
       "      <td>[methanobactin]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>85</th>\n",
       "      <td>[linaridin]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>86</th>\n",
       "      <td>[NRPS, NRPS-like, T1PKS, phenazine]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>87</th>\n",
       "      <td>[PKS-like, T1PKS, terpene]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>88</th>\n",
       "      <td>[ranthipeptide]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>89</th>\n",
       "      <td>[T1PKS, T2PKS, transAT-PKS]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>90</th>\n",
       "      <td>[NRPS, fungal-RiPP-like]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>91</th>\n",
       "      <td>[transAT-PKS-like]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>92</th>\n",
       "      <td>[fungal-RiPP, fungal-RiPP-like]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>93</th>\n",
       "      <td>[NAGGN, T1PKS]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>94</th>\n",
       "      <td>[T1PKS, T3PKS]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                             bgc_type  count\n",
       "0                                           [ectoine]    257\n",
       "1                                         [NRPS-like]    225\n",
       "2                                             [T3PKS]    123\n",
       "3                                           [terpene]    107\n",
       "4                                             [T1PKS]     81\n",
       "5                                       [NRPS, T1PKS]     74\n",
       "6                                              [NRPS]     72\n",
       "7                           [arylpolyene, resorcinol]     69\n",
       "8                                  [NRPS-like, T1PKS]     65\n",
       "9                                       [arylpolyene]     57\n",
       "10                           [NRP-metallophore, NRPS]     38\n",
       "11                                 [fungal-RiPP-like]     36\n",
       "12                                   [T1PKS, hglE-KS]     34\n",
       "13                                      [betalactone]     28\n",
       "14                                        [RiPP-like]     27\n",
       "15                                 [acyl_amino_acids]     19\n",
       "16                    [acyl_amino_acids, hserlactone]     17\n",
       "17                           [NRPS, NRPS-like, T1PKS]     16\n",
       "18                                            [T2PKS]     15\n",
       "19                                   [T1PKS, terpene]     15\n",
       "20                                          [hglE-KS]     12\n",
       "21                                   [redox-cofactor]     11\n",
       "22                                   [RRE-containing]     11\n",
       "23                            [lanthipeptide-class-v]     11\n",
       "24                               [RiPP-like, terpene]      8\n",
       "25                                      [hserlactone]      8\n",
       "26                                              [LAP]      7\n",
       "27                                            [NAGGN]      7\n",
       "28                                      [thiopeptide]      7\n",
       "29               [NRPS-like, T1PKS, transAT-PKS-like]      7\n",
       "30                                     [T1PKS, T2PKS]      6\n",
       "31                                            [NAPAA]      6\n",
       "32                                   [NI-siderophore]      6\n",
       "33                                   [T3PKS, terpene]      6\n",
       "34                                             [CDPS]      5\n",
       "35                                      [cyanobactin]      4\n",
       "36                                        [proteusin]      4\n",
       "37         [NRP-metallophore, NRPS, acyl_amino_acids]      4\n",
       "38                      [T1PKS, betalactone, hglE-KS]      4\n",
       "39                                      [phosphonate]      4\n",
       "40                                 [phosphonate-like]      4\n",
       "41                           [NRPS-like, betalactone]      3\n",
       "42                 [arylpolyene, resorcinol, terpene]      3\n",
       "43                                [NRPS, hserlactone]      3\n",
       "44                                            [other]      3\n",
       "45                   [NRPS, betalactone, transAT-PKS]      3\n",
       "46                                     [lassopeptide]      3\n",
       "47                                  [NRPS, NRPS-like]      3\n",
       "48                        [thioamitides, thiopeptide]      2\n",
       "49                                           [indole]      2\n",
       "50  [NRPS, NRPS-like, PKS-like, T1PKS, transAT-PKS...      2\n",
       "51                                         [PKS-like]      2\n",
       "52                    [NRP-metallophore, NRPS, T1PKS]      2\n",
       "53                   [NRPS, PKS-like, T1PKS, terpene]      2\n",
       "54                                             [2dos]      2\n",
       "55                             [NI-siderophore, NRPS]      2\n",
       "56                       [cyclic-lactone-autoinducer]      2\n",
       "57                             [NRPS, T1PKS, terpene]      2\n",
       "58                      [LAP, proteusin, thiopeptide]      1\n",
       "59      [NRPS-like, T1PKS, hglE-KS, transAT-PKS-like]      1\n",
       "60                                     [thioamitides]      1\n",
       "61         [NRPS, NRPS-like, T1PKS, transAT-PKS-like]      1\n",
       "62         [NRPS-like, RiPP-like, T1PKS, transAT-PKS]      1\n",
       "63                                       [epipeptide]      1\n",
       "64                               [NRPS-like, terpene]      1\n",
       "65                     [NRPS, NRPS-like, transAT-PKS]      1\n",
       "66                    [NRPS, T1PKS, fungal-RiPP-like]      1\n",
       "67                          [T1PKS, fungal-RiPP-like]      1\n",
       "68         [NRP-metallophore, NRPS, NRPS-like, T1PKS]      1\n",
       "69                 [arylpolyene, ectoine, resorcinol]      1\n",
       "70           [NRPS, NRPS-like, T1PKS, T3PKS, terpene]      1\n",
       "71                                       [isocyanide]      1\n",
       "72  [NRPS, NRPS-like, T1PKS, betalactone, transAT-...      1\n",
       "73                           [NRPS-like, transAT-PKS]      1\n",
       "74                           [lanthipeptide-class-iv]      1\n",
       "75                  [T1PKS, hglE-KS, oligosaccharide]      1\n",
       "76                  [NRPS, fungal-RiPP-like, terpene]      1\n",
       "77                                   [isocyanide-nrp]      1\n",
       "78                                 [mycosporine-like]      1\n",
       "79                                      [fungal-RiPP]      1\n",
       "80                                 [NAPAA, NRPS-like]      1\n",
       "81                      [NRPS, T1PKS, T3PKS, terpene]      1\n",
       "82      [LAP, NRPS, T1PKS, thioamitides, thiopeptide]      1\n",
       "83                                 [LAP, thiopeptide]      1\n",
       "84                                    [methanobactin]      1\n",
       "85                                        [linaridin]      1\n",
       "86                [NRPS, NRPS-like, T1PKS, phenazine]      1\n",
       "87                         [PKS-like, T1PKS, terpene]      1\n",
       "88                                    [ranthipeptide]      1\n",
       "89                        [T1PKS, T2PKS, transAT-PKS]      1\n",
       "90                           [NRPS, fungal-RiPP-like]      1\n",
       "91                                 [transAT-PKS-like]      1\n",
       "92                    [fungal-RiPP, fungal-RiPP-like]      1\n",
       "93                                     [NAGGN, T1PKS]      1\n",
       "94                                     [T1PKS, T3PKS]      1"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%time\n",
    "with GraphDriver() as db:\n",
    "        df = db.run(\n",
    "            \"\"\"\n",
    "        MATCH (:hmm_source {acc:\"PF00227.29\"})-[:SOURCE_DB]-(:hmm)-[:ANNOTATES]->(:protein)<-[e1:ENCODES]-(n1:nucleotide)-[:ASSEMBLES_TO]-(a1:assembly)\n",
    "        where e1.antismash_region is not null and not n1.external_id starts with \"BGC\" \n",
    "        WITH distinct a1, n1, e1.antismash_region as ar, apoc.coll.sort(e1.antismash_products) as ap\n",
    "        WITH collect(ap) as zz\n",
    "        with apoc.coll.frequenciesAsMap(zz) as w\n",
    "        unwind keys(w) as ww\n",
    "        return ww as bgc_type, w[ww] as count order by count DESC\n",
    "        \"\"\",\n",
    "        ).to_df()\n",
    "\n",
    "df\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Bacterial BGC types"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 6.65 ms, sys: 187 µs, total: 6.83 ms\n",
      "Wall time: 1.5 s\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>bgc_type</th>\n",
       "      <th>count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[ectoine]</td>\n",
       "      <td>257</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>[NRPS-like]</td>\n",
       "      <td>180</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>[T3PKS]</td>\n",
       "      <td>120</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>[terpene]</td>\n",
       "      <td>78</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>[NRPS, T1PKS]</td>\n",
       "      <td>70</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>[arylpolyene, resorcinol]</td>\n",
       "      <td>69</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>[NRPS-like, T1PKS]</td>\n",
       "      <td>57</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>[arylpolyene]</td>\n",
       "      <td>57</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>[T1PKS]</td>\n",
       "      <td>48</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>[NRPS]</td>\n",
       "      <td>42</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>[T1PKS, hglE-KS]</td>\n",
       "      <td>34</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>[RiPP-like]</td>\n",
       "      <td>23</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>[acyl_amino_acids]</td>\n",
       "      <td>19</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>[acyl_amino_acids, hserlactone]</td>\n",
       "      <td>17</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>[betalactone]</td>\n",
       "      <td>16</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>[T2PKS]</td>\n",
       "      <td>15</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>[NRPS, NRPS-like, T1PKS]</td>\n",
       "      <td>15</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>[T1PKS, terpene]</td>\n",
       "      <td>13</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>[hglE-KS]</td>\n",
       "      <td>12</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>[redox-cofactor]</td>\n",
       "      <td>11</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>[lanthipeptide-class-v]</td>\n",
       "      <td>11</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>[RiPP-like, terpene]</td>\n",
       "      <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>[hserlactone]</td>\n",
       "      <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>[LAP]</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>[NAGGN]</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>[NRPS-like, T1PKS, transAT-PKS-like]</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>[T1PKS, T2PKS]</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>[NAPAA]</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>[T3PKS, terpene]</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>[CDPS]</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>[cyanobactin]</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>[proteusin]</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>[NRP-metallophore, NRPS, acyl_amino_acids]</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>[T1PKS, betalactone, hglE-KS]</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>34</th>\n",
       "      <td>[phosphonate]</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35</th>\n",
       "      <td>[NI-siderophore]</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>36</th>\n",
       "      <td>[phosphonate-like]</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>37</th>\n",
       "      <td>[NRPS-like, betalactone]</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>38</th>\n",
       "      <td>[arylpolyene, resorcinol, terpene]</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>39</th>\n",
       "      <td>[NRPS, hserlactone]</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>40</th>\n",
       "      <td>[other]</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>41</th>\n",
       "      <td>[NRP-metallophore, NRPS]</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>42</th>\n",
       "      <td>[NRPS, betalactone, transAT-PKS]</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>43</th>\n",
       "      <td>[lassopeptide]</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>44</th>\n",
       "      <td>[NRPS, NRPS-like]</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>45</th>\n",
       "      <td>[RRE-containing]</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>46</th>\n",
       "      <td>[indole]</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>47</th>\n",
       "      <td>[NRPS, NRPS-like, PKS-like, T1PKS, transAT-PKS...</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>48</th>\n",
       "      <td>[PKS-like]</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>49</th>\n",
       "      <td>[NRP-metallophore, NRPS, T1PKS]</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>50</th>\n",
       "      <td>[NRPS, PKS-like, T1PKS, terpene]</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>51</th>\n",
       "      <td>[2dos]</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>52</th>\n",
       "      <td>[NI-siderophore, NRPS]</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>53</th>\n",
       "      <td>[cyclic-lactone-autoinducer]</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>54</th>\n",
       "      <td>[NRPS, T1PKS, terpene]</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>55</th>\n",
       "      <td>[LAP, proteusin, thiopeptide]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>56</th>\n",
       "      <td>[NRPS-like, T1PKS, hglE-KS, transAT-PKS-like]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>57</th>\n",
       "      <td>[NRPS, NRPS-like, T1PKS, transAT-PKS-like]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>58</th>\n",
       "      <td>[NRPS-like, RiPP-like, T1PKS, transAT-PKS]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>59</th>\n",
       "      <td>[epipeptide]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>60</th>\n",
       "      <td>[NRPS-like, terpene]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>61</th>\n",
       "      <td>[NRPS, NRPS-like, transAT-PKS]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>62</th>\n",
       "      <td>[NRP-metallophore, NRPS, NRPS-like, T1PKS]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>63</th>\n",
       "      <td>[arylpolyene, ectoine, resorcinol]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>64</th>\n",
       "      <td>[NRPS, NRPS-like, T1PKS, T3PKS, terpene]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>65</th>\n",
       "      <td>[NRPS, NRPS-like, T1PKS, betalactone, transAT-...</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>66</th>\n",
       "      <td>[NRPS-like, transAT-PKS]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>67</th>\n",
       "      <td>[thioamitides, thiopeptide]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>68</th>\n",
       "      <td>[lanthipeptide-class-iv]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>69</th>\n",
       "      <td>[T1PKS, hglE-KS, oligosaccharide]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>70</th>\n",
       "      <td>[mycosporine-like]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>71</th>\n",
       "      <td>[NAPAA, NRPS-like]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>72</th>\n",
       "      <td>[NRPS, T1PKS, T3PKS, terpene]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>73</th>\n",
       "      <td>[LAP, NRPS, T1PKS, thioamitides, thiopeptide]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>74</th>\n",
       "      <td>[methanobactin]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>75</th>\n",
       "      <td>[NRPS, NRPS-like, T1PKS, phenazine]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>76</th>\n",
       "      <td>[PKS-like, T1PKS, terpene]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>77</th>\n",
       "      <td>[ranthipeptide]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>78</th>\n",
       "      <td>[T1PKS, T2PKS, transAT-PKS]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>79</th>\n",
       "      <td>[thiopeptide]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>80</th>\n",
       "      <td>[transAT-PKS-like]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>81</th>\n",
       "      <td>[NAGGN, T1PKS]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>82</th>\n",
       "      <td>[T1PKS, T3PKS]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                             bgc_type  count\n",
       "0                                           [ectoine]    257\n",
       "1                                         [NRPS-like]    180\n",
       "2                                             [T3PKS]    120\n",
       "3                                           [terpene]     78\n",
       "4                                       [NRPS, T1PKS]     70\n",
       "5                           [arylpolyene, resorcinol]     69\n",
       "6                                  [NRPS-like, T1PKS]     57\n",
       "7                                       [arylpolyene]     57\n",
       "8                                             [T1PKS]     48\n",
       "9                                              [NRPS]     42\n",
       "10                                   [T1PKS, hglE-KS]     34\n",
       "11                                        [RiPP-like]     23\n",
       "12                                 [acyl_amino_acids]     19\n",
       "13                    [acyl_amino_acids, hserlactone]     17\n",
       "14                                      [betalactone]     16\n",
       "15                                            [T2PKS]     15\n",
       "16                           [NRPS, NRPS-like, T1PKS]     15\n",
       "17                                   [T1PKS, terpene]     13\n",
       "18                                          [hglE-KS]     12\n",
       "19                                   [redox-cofactor]     11\n",
       "20                            [lanthipeptide-class-v]     11\n",
       "21                               [RiPP-like, terpene]      8\n",
       "22                                      [hserlactone]      8\n",
       "23                                              [LAP]      7\n",
       "24                                            [NAGGN]      7\n",
       "25               [NRPS-like, T1PKS, transAT-PKS-like]      7\n",
       "26                                     [T1PKS, T2PKS]      6\n",
       "27                                            [NAPAA]      6\n",
       "28                                   [T3PKS, terpene]      6\n",
       "29                                             [CDPS]      5\n",
       "30                                      [cyanobactin]      4\n",
       "31                                        [proteusin]      4\n",
       "32         [NRP-metallophore, NRPS, acyl_amino_acids]      4\n",
       "33                      [T1PKS, betalactone, hglE-KS]      4\n",
       "34                                      [phosphonate]      4\n",
       "35                                   [NI-siderophore]      4\n",
       "36                                 [phosphonate-like]      4\n",
       "37                           [NRPS-like, betalactone]      3\n",
       "38                 [arylpolyene, resorcinol, terpene]      3\n",
       "39                                [NRPS, hserlactone]      3\n",
       "40                                            [other]      3\n",
       "41                           [NRP-metallophore, NRPS]      3\n",
       "42                   [NRPS, betalactone, transAT-PKS]      3\n",
       "43                                     [lassopeptide]      3\n",
       "44                                  [NRPS, NRPS-like]      3\n",
       "45                                   [RRE-containing]      2\n",
       "46                                           [indole]      2\n",
       "47  [NRPS, NRPS-like, PKS-like, T1PKS, transAT-PKS...      2\n",
       "48                                         [PKS-like]      2\n",
       "49                    [NRP-metallophore, NRPS, T1PKS]      2\n",
       "50                   [NRPS, PKS-like, T1PKS, terpene]      2\n",
       "51                                             [2dos]      2\n",
       "52                             [NI-siderophore, NRPS]      2\n",
       "53                       [cyclic-lactone-autoinducer]      2\n",
       "54                             [NRPS, T1PKS, terpene]      2\n",
       "55                      [LAP, proteusin, thiopeptide]      1\n",
       "56      [NRPS-like, T1PKS, hglE-KS, transAT-PKS-like]      1\n",
       "57         [NRPS, NRPS-like, T1PKS, transAT-PKS-like]      1\n",
       "58         [NRPS-like, RiPP-like, T1PKS, transAT-PKS]      1\n",
       "59                                       [epipeptide]      1\n",
       "60                               [NRPS-like, terpene]      1\n",
       "61                     [NRPS, NRPS-like, transAT-PKS]      1\n",
       "62         [NRP-metallophore, NRPS, NRPS-like, T1PKS]      1\n",
       "63                 [arylpolyene, ectoine, resorcinol]      1\n",
       "64           [NRPS, NRPS-like, T1PKS, T3PKS, terpene]      1\n",
       "65  [NRPS, NRPS-like, T1PKS, betalactone, transAT-...      1\n",
       "66                           [NRPS-like, transAT-PKS]      1\n",
       "67                        [thioamitides, thiopeptide]      1\n",
       "68                           [lanthipeptide-class-iv]      1\n",
       "69                  [T1PKS, hglE-KS, oligosaccharide]      1\n",
       "70                                 [mycosporine-like]      1\n",
       "71                                 [NAPAA, NRPS-like]      1\n",
       "72                      [NRPS, T1PKS, T3PKS, terpene]      1\n",
       "73      [LAP, NRPS, T1PKS, thioamitides, thiopeptide]      1\n",
       "74                                    [methanobactin]      1\n",
       "75                [NRPS, NRPS-like, T1PKS, phenazine]      1\n",
       "76                         [PKS-like, T1PKS, terpene]      1\n",
       "77                                    [ranthipeptide]      1\n",
       "78                        [T1PKS, T2PKS, transAT-PKS]      1\n",
       "79                                      [thiopeptide]      1\n",
       "80                                 [transAT-PKS-like]      1\n",
       "81                                     [NAGGN, T1PKS]      1\n",
       "82                                     [T1PKS, T3PKS]      1"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%time\n",
    "with GraphDriver() as db:\n",
    "        df = db.run(\n",
    "            \"\"\"\n",
    "        MATCH (:hmm_source {acc:\"PF00227.29\"})-[:SOURCE_DB]-(:hmm)-[:ANNOTATES]->(:protein)<-[e1:ENCODES]-(n1:nucleotide)-[:ASSEMBLES_TO]-(a1:assembly)\n",
    "        where e1.antismash_region is not null and not n1.external_id starts with \"BGC\" \n",
    "        WITH distinct a1, n1, e1.antismash_region as ar, apoc.coll.sort(e1.antismash_products) as ap\n",
    "        where a1.superkingdom=\"Bacteria\"\n",
    "        WITH collect(ap) as zz\n",
    "        with apoc.coll.frequenciesAsMap(zz) as w\n",
    "        unwind keys(w) as ww\n",
    "        return ww as bgc_type, w[ww] as count ORDER BY count DESC \n",
    "        \"\"\",\n",
    "        ).to_df()\n",
    "\n",
    "df\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Eukaryota BGC types"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 3.25 ms, sys: 0 ns, total: 3.25 ms\n",
      "Wall time: 1.4 s\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>bgc_type</th>\n",
       "      <th>count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[NRPS-like]</td>\n",
       "      <td>45</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>[fungal-RiPP-like]</td>\n",
       "      <td>36</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>[NRP-metallophore, NRPS]</td>\n",
       "      <td>35</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>[T1PKS]</td>\n",
       "      <td>32</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>[NRPS]</td>\n",
       "      <td>25</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>[terpene]</td>\n",
       "      <td>13</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>[NRPS-like, T1PKS]</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>[NRPS, T1PKS]</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>[T3PKS]</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>[T1PKS, terpene]</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>[NRPS, fungal-RiPP-like, terpene]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>[isocyanide-nrp]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>[isocyanide]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>[fungal-RiPP]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>[NRPS, fungal-RiPP-like]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>[NRPS, T1PKS, fungal-RiPP-like]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>[T1PKS, fungal-RiPP-like]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>[fungal-RiPP, fungal-RiPP-like]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>[NRPS, NRPS-like, T1PKS]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                             bgc_type  count\n",
       "0                         [NRPS-like]     45\n",
       "1                  [fungal-RiPP-like]     36\n",
       "2            [NRP-metallophore, NRPS]     35\n",
       "3                             [T1PKS]     32\n",
       "4                              [NRPS]     25\n",
       "5                           [terpene]     13\n",
       "6                  [NRPS-like, T1PKS]      7\n",
       "7                       [NRPS, T1PKS]      4\n",
       "8                             [T3PKS]      3\n",
       "9                    [T1PKS, terpene]      2\n",
       "10  [NRPS, fungal-RiPP-like, terpene]      1\n",
       "11                   [isocyanide-nrp]      1\n",
       "12                       [isocyanide]      1\n",
       "13                      [fungal-RiPP]      1\n",
       "14           [NRPS, fungal-RiPP-like]      1\n",
       "15    [NRPS, T1PKS, fungal-RiPP-like]      1\n",
       "16          [T1PKS, fungal-RiPP-like]      1\n",
       "17    [fungal-RiPP, fungal-RiPP-like]      1\n",
       "18           [NRPS, NRPS-like, T1PKS]      1"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%time\n",
    "with GraphDriver() as db:\n",
    "        df = db.run(\n",
    "            \"\"\"\n",
    "        MATCH (:hmm_source {acc:\"PF00227.29\"})-[:SOURCE_DB]-(:hmm)-[:ANNOTATES]->(:protein)<-[e1:ENCODES]-(n1:nucleotide)-[:ASSEMBLES_TO]-(a1:assembly)\n",
    "        where e1.antismash_region is not null and not n1.external_id starts with \"BGC\" \n",
    "        WITH distinct a1, n1, e1.antismash_region as ar, apoc.coll.sort(e1.antismash_products) as ap\n",
    "        where a1.superkingdom=\"Eukaryota\"\n",
    "        WITH collect(ap) as zz\n",
    "        with apoc.coll.frequenciesAsMap(zz) as w\n",
    "        unwind keys(w) as ww\n",
    "        return ww as bgc_type, w[ww] as count ORDER BY count DESC \n",
    "        \"\"\",\n",
    "        ).to_df()\n",
    "\n",
    "df\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Archaea BGC types"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 2.9 ms, sys: 0 ns, total: 2.9 ms\n",
      "Wall time: 1.54 s\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>bgc_type</th>\n",
       "      <th>count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[terpene]</td>\n",
       "      <td>14</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>[betalactone]</td>\n",
       "      <td>12</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>[RRE-containing]</td>\n",
       "      <td>9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>[thiopeptide]</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>[NRPS]</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>[RiPP-like]</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>[NI-siderophore]</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>[linaridin]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>[thioamitides]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>[thioamitides, thiopeptide]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>[LAP, thiopeptide]</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                       bgc_type  count\n",
       "0                     [terpene]     14\n",
       "1                 [betalactone]     12\n",
       "2              [RRE-containing]      9\n",
       "3                 [thiopeptide]      6\n",
       "4                        [NRPS]      5\n",
       "5                   [RiPP-like]      4\n",
       "6              [NI-siderophore]      2\n",
       "7                   [linaridin]      1\n",
       "8                [thioamitides]      1\n",
       "9   [thioamitides, thiopeptide]      1\n",
       "10           [LAP, thiopeptide]      1"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%time\n",
    "with GraphDriver() as db:\n",
    "        df = db.run(\n",
    "            \"\"\"\n",
    "        MATCH (:hmm_source {acc:\"PF00227.29\"})-[:SOURCE_DB]-(:hmm)-[:ANNOTATES]->(:protein)<-[e1:ENCODES]-(n1:nucleotide)-[:ASSEMBLES_TO]-(a1:assembly)\n",
    "        where e1.antismash_region is not null and not n1.external_id starts with \"BGC\" \n",
    "        WITH distinct a1, n1, e1.antismash_region as ar, apoc.coll.sort(e1.antismash_products) as ap\n",
    "        where a1.superkingdom = \"Archaea\" \n",
    "        WITH collect(ap) as zz\n",
    "        with apoc.coll.frequenciesAsMap(zz) as w\n",
    "        unwind keys(w) as ww\n",
    "        return ww as bgc_type, w[ww] as count ORDER BY count DESC \n",
    "        \"\"\",\n",
    "        ).to_df()\n",
    "\n",
    "df\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Grab the BGC clusters from the SocialGene database and create genbank files for each cluster"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 77.8 ms, sys: 8.19 ms, total: 86 ms\n",
      "Wall time: 3.42 s\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "with GraphDriver() as db:\n",
    "    res = db.run(\n",
    "        \"\"\"\n",
    "    MATCH (:hmm_source {acc:\"PF00227.29\"})-[:SOURCE_DB]-(:hmm)-[:ANNOTATES]->(:protein)<-[e1:ENCODES]-(n1:nucleotide)-[:ASSEMBLES_TO]-(a1:assembly)\n",
    "    where e1.antismash_region is not null and not n1.external_id starts with \"BGC\"\n",
    "    WITH DISTINCT n1, e1.antismash_region as ar\n",
    "    MATCH (n1)-[e1:ENCODES]-(p1:protein)\n",
    "    WHERE e1.antismash_region = ar\n",
    "    WITH n1, e1.antismash_region as ar,  e1.antismash_products as type, min(e1.start) as start, max(e1.end) as end \n",
    "    RETURN n1.uid as nucelotide_id, n1.external_id as external_id, ar as region, type, start, end \n",
    "    \"\"\",\n",
    "    ).data()\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "sg = SocialGene()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "for i in res:\n",
    "    z = sg.fill_given_locus_range(locus_uid=i[\"nucelotide_id\"], start=i[\"start\"], end=i[\"end\"])\n",
    "    sg.assemblies[z['assembly']].loci[z['locus']].add_bgcs_by_start_end(start=i[\"start\"], end=i[\"end\"], uid=f'{i[\"region\"]}_{\"-\".join(i[\"type\"])}')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "sg.add_sequences_from_neo4j()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [],
   "source": [
    "for ak,av in sg.assemblies.items():\n",
    "    for nk,nv in av.loci.items():\n",
    "        for gene_cluster in nv.gene_clusters:\n",
    "            gene_cluster.write_genbank(f\"bgc_gbk/{ak}_{nv.external_id}_{gene_cluster.uid}.gbk\")\n",
    "        \n",
    "    "
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "py312",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
